In [1]:
import pandas as pd
import numpy as np

In [2]:
series = pd.Series([1,2,3,4,5])
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
my_dict = {'name': ['Ahmed', 'Ali', 'Sara', 'Mona', None , 'Omar'],
           'age': [25, None, 22, 28 , 27 ,33],
           'city': ['Cairo', 'Alex', 'Giza', 'Cairo', 'Luxor', None]
           }
dataFrame = pd.DataFrame(my_dict)
dataFrame

    name   age   city
0  Ahmed  25.0  Cairo
1    Ali   NaN   Alex
2   Sara  22.0   Giza
3   Mona  28.0  Cairo
4   None  27.0  Luxor
5   Omar  33.0   None

In [4]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      float64
 2   city    5 non-null      object
dtypes: float64(1), object(2)
memory usage: 276.0+ bytes

In [5]:
dataFrame.head() # shows first 5 rows
dataFrame.head(2) # shows first 2 rows (set number of rows)
dataFrame.tail() # shows last 5 rows
dataFrame.tail(2) # shows last 2 rows (set number of rows)

   name   age   city
4  None  27.0  Luxor
5  Omar  33.0   None

In [6]:
# descripe statistical summary for numerical columns
dataFrame.describe()
# transpose the output
dataFrame.describe().T
dataFrame.describe(include='all').T # describe for all columns including categorical columns

     count unique    top freq  mean       std   min   25%   50%   75%   max
name     5      5  Ahmed    1   NaN       NaN   NaN   NaN   NaN   NaN   NaN
age    5.0    NaN    NaN  NaN  27.0  4.062019  22.0  25.0  27.0  28.0  33.0
city     5      4  Cairo    2   NaN       NaN   NaN   NaN   NaN   NaN   NaN

In [7]:
dataFrame['age']

0    25.0
1     NaN
2    22.0
3    28.0
4    27.0
5    33.0
Name: age, dtype: float64

In [8]:
dataFrame[dataFrame['age'] > 25]  # filter rows where age > 25 syntax is dataFrame[condition] condition -> dataFrame['age'] > 25
dataFrame[(dataFrame['age'] > 25) & (dataFrame['city'] == 'Cairo')]  # filter rows where age > 25 and city is Cairo
dataFrame[(dataFrame['age'] > 25) | (dataFrame['city'] == 'Cairo')]  # filter rows where age > 25 or city is Cairo

    name   age   city
0  Ahmed  25.0  Cairo
3   Mona  28.0  Cairo
4   None  27.0  Luxor
5   Omar  33.0   None

In [9]:
dataFrame[['name', 'city']]  # select specific columns
dataFrame.loc[0:3, ['name', 'city']]  # select specific columns and rows range
dataFrame.iloc[0:3, 0:2]  # select specific columns and rows range by index

    name   age
0  Ahmed  25.0
1    Ali   NaN
2   Sara  22.0

In [10]:
dataFrame['salary'] = [5000, 6000, 5500, 7000, 6500, 7200]  # add new column must match the number of rows in the data frame
dataFrame

    name   age   city  salary
0  Ahmed  25.0  Cairo    5000
1    Ali   NaN   Alex    6000
2   Sara  22.0   Giza    5500
3   Mona  28.0  Cairo    7000
4   None  27.0  Luxor    6500
5   Omar  33.0   None    7200

In [11]:
dataFrame['age']= dataFrame['age'] + 1  # update age column by adding 1 to each value
dataFrame

    name   age   city  salary
0  Ahmed  26.0  Cairo    5000
1    Ali   NaN   Alex    6000
2   Sara  23.0   Giza    5500
3   Mona  29.0  Cairo    7000
4   None  28.0  Luxor    6500
5   Omar  34.0   None    7200

In [12]:
newdf = dataFrame.drop('salary',axis=1) # drop salary column axis=1 for columns axis=0 for rows inplace=True to modify the original data frame 
# if inplace=False it returns a new data frame without modifying the original one
newdf = dataFrame.drop([0,1]) # drop rows with index 0 and 1
newdf

   name   age   city  salary
2  Sara  23.0   Giza    5500
3  Mona  29.0  Cairo    7000
4  None  28.0  Luxor    6500
5  Omar  34.0   None    7200

In [13]:
newdf.reset_index  # reset index after dropping rows to have continuous index

<bound method DataFrame.reset_index of    name   age   city  salary
2  Sara  23.0   Giza    5500
3  Mona  29.0  Cairo    7000
4  None  28.0  Luxor    6500
5  Omar  34.0   None    7200>

In [14]:
dataFrame.isnull()  # check for null values
dataFrame.isnull().sum()  # count of null values in each column

name      1
age       1
city      1
salary    0
dtype: int64

In [15]:
dataFrame['city'].fillna(dataFrame['city'].mode()[0], inplace=True) # fill null values in city column with the most frequent value mode()[0] to get the first mode returned
dataFrame['age'].fillna(dataFrame['age'].mean(), inplace=True) # fill null values in age column with the mean value
dataFrame

C:\Users\mosta\AppData\Local\Temp\ipykernel_17612\3468120872.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataFrame['city'].fillna(dataFrame['city'].mode()[0], inplace=True) # fill null values in city column with the most frequent value mode()[0] to get the first mode returned
C:\Users\mosta\AppData\Local\Temp\ipykernel_17612\3468120872.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataFrame['age'].fillna(dataFrame['age'].mean(), inplace=True) # fill null values in age column with the mean value

    name   age   city  salary
0  Ahmed  26.0  Cairo    5000
1    Ali  28.0   Alex    6000
2   Sara  23.0   Giza    5500
3   Mona  29.0  Cairo    7000
4   None  28.0  Luxor    6500
5   Omar  34.0  Cairo    7200

In [16]:
# drop null rows 
dataFrame.dropna(inplace=True)  # drop rows with null values inplace=True to modify the original data frame
dataFrame
dataFrame.reset_index(inplace=True, drop=True) 
dataFrame

    name   age   city  salary
0  Ahmed  26.0  Cairo    5000
1    Ali  28.0   Alex    6000
2   Sara  23.0   Giza    5500
3   Mona  29.0  Cairo    7000
4   Omar  34.0  Cairo    7200

In [17]:
dataFrame.isnull().sum()

name      0
age       0
city      0
salary    0
dtype: int64

In [18]:
# Grouping and Aggregation
x = dataFrame.groupby('city' )['age'].mean()  # group by city and calculate mean age for each city
print(x)

city
Alex     28.000000
Cairo    29.666667
Giza     23.000000
Name: age, dtype: float64

In [19]:
def double_salary(salary):
    return salary * 2

dataFrame['doubleSalary'] = dataFrame['salary'].apply(double_salary)  # apply function to salary column
# or using lambda function
dataFrame['tripleSalary'] = dataFrame['salary'].apply(lambda x: x * 3)  # apply lambda function to salary column
dataFrame

    name   age   city  salary  doubleSalary  tripleSalary
0  Ahmed  26.0  Cairo    5000         10000         15000
1    Ali  28.0   Alex    6000         12000         18000
2   Sara  23.0   Giza    5500         11000         16500
3   Mona  29.0  Cairo    7000         14000         21000
4   Omar  34.0  Cairo    7200         14400         21600

In [20]:
data = pd.read_csv('employees.csv')  # read csv file
print(data.head())
print(data.info())

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes
None

In [21]:
data.describe().T    # numirical only

,count,mean,std,min,25%,50%,75%,max
ID,10.0,5.5,3.027650,1.0,3.25,5.5,7.75,10.0
Age,10.0,35.3,7.958922,26.0,29.25,33.0,40.25,50.0
Salary,10.0,68300.0,13106.826042,50000.0,57250.00,69000.0,74250.00,90000.0

In [22]:
data[data['Department'] == 'IT']

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

In [23]:
data.groupby('Department')['Salary'].mean()

Department
Finance      87500.000000
HR           53000.000000
IT           70333.333333
Marketing    69000.000000
Name: Salary, dtype: float64

In [24]:
#data['NewSalary'] = data['Salary'].apply(lambda x : x * 1.05)
data['NewSalary'] = data['Salary'] * 1.05
data

   ID           Name Department  Age  Salary Joining_Date  NewSalary
0   1       John Doe         HR   28   50000   2020-05-21    52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12    78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15    89250.0
3   4    Alice White         IT   29   72000   2021-01-04    75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    71400.0
5   6      Eva Green         HR   41   54000   2017-04-22    56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19    94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10    67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08    73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18    57750.0

In [25]:
sortedData = data.sort_values('Age' , ascending=False)
sortedData

   ID           Name Department  Age  Salary Joining_Date  NewSalary
6   7     Mike Davis    Finance   50   90000   2016-08-19    94500.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15    89250.0
5   6      Eva Green         HR   41   54000   2017-04-22    56700.0
8   9   James Wilson  Marketing   38   70000   2020-09-08    73500.0
1   2     Jane Smith         IT   34   75000   2019-06-12    78750.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    71400.0
9  10    Sarah Adams         HR   30   55000   2021-03-18    57750.0
3   4    Alice White         IT   29   72000   2021-01-04    75600.0
0   1       John Doe         HR   28   50000   2020-05-21    52500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10    67200.0

In [26]:
data['Department'].value_counts()

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [27]:
data['Joining_Date'] = pd.to_datetime(data['Joining_Date'])
data = data[data['Joining_Date'] > "2020-01-01"]
data

   ID          Name Department  Age  Salary Joining_Date  NewSalary
0   1      John Doe         HR   28   50000   2020-05-21    52500.0
3   4   Alice White         IT   29   72000   2021-01-04    75600.0
7   8  Linda Taylor         IT   26   64000   2022-02-10    67200.0
8   9  James Wilson  Marketing   38   70000   2020-09-08    73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18    57750.0

In [28]:
data.to_csv("new_data.csv")